rtg-init.org
#+TITLE: Sitesonix Emacs Configuration
#+STARTUP: hideall

* Configuration

** 00. Introduction

#+BEGIN_SRC emacs-lisp :tangle yes
;;; package --- Summary

;;; Commentary: Personalized init file for Emacs Prelude.

;; Copyright (c) 2017 Ryan Griffith
;;
;; Author: Ryan Griffith <ryan@sitesonix.net>
;; URL: https://sitesonix.net/
;; Version: 2.5
;; Keywords: org gtd web

;; This file is not a part of GNU Emacs.

;;; License:

;; This program is free software; you can redistribute it and/or
;; modify it under the terms of the GNU General Public License
;; as published by the Free Software Foundation; either version 3
;; of the License, or (at your option) any later version.
;;
;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs; see the file COPYING.  If not, write to the
;; Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,
;; Boston, MA 02110-1301, USA.

;;; Sections:

;; 00. Introduction
;; 01. Prelude Require Packages
;; 02. Basic Editor Preferences
;; 03. Theme Preferences
;; 04. Mode Specific (General)
;; 05. Dired and Ibuffer Tweaks
;; 06. Terminals and Shells
;; 07. Org Mode Configuration
;; 08. Web Development
;; 09. Miscellaneous Stuff
;; 10. Close Init
#+END_SRC

** 01. Prelude Require Packages

*** Prelude's require package section.

#+BEGIN_SRC emacs-lisp :tangle yes
(prelude-require-packages '(apache-mode
                            company-web
                            counsel
                            ctags
                            dash
                            dired+
                            emmet-mode
                            flymd
                            htmlize
                            impatient-mode
                            ivy
                            js2-mode
                            js2-refactor
                            multi-term
                            multiple-cursors
                            olivetti
                            org2blog
                            org-password-manager
                            php-mode
                            project-explorer
                            s
                            simple-httpd
                            skewer-mode
                            swiper
                            twittering-mode
                            web-beautify
                            ztree))
#+END_SRC

** 02. Basic Editor Preferences

*** Set my user details.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq full-name "Ryan Griffith")
(setq user-mail-address "ryan@sitesonix.net")
#+END_SRC

*** Set the default coding system to UTF-8.

#+BEGIN_SRC emacs-lisp :tangle yes
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
#+END_SRC

*** Set a reasonable default font size.

#+BEGIN_SRC emacs-lisp :tangle yes
(set-face-attribute 'default nil :height 100)
#+END_SRC

*** Cursor blinking enabled so I can find it more easily.

#+BEGIN_SRC emacs-lisp :tangle yes
(blink-cursor-mode t)
#+END_SRC

*** The scroll bar isn't necessary.

#+BEGIN_SRC emacs-lisp :tangle yes
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
#+END_SRC

*** Set the frame title to show filename plus working directory.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq uniquify-buffer-name-style 'reverse)
(setq inhibit-default-init t)
(setq-default frame-title-format "%b (%f)")
(global-set-key "\M-n" "\C-u1\C-v")
(global-set-key "\M-p" "\C-u1\M-v")
#+END_SRC

*** Display the date and time in the mode line.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq display-time-day-and-date t
      display-time-12hr-format t)
(display-time)
#+END_SRC

*** Customize the scratch buffer with a fortune cookie.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun my-fortune-scratch-message ()
  (interactive)
  (let ((fortune
         (when (executable-find "fortune")
           (with-temp-buffer
             (shell-command "fortune" t)
             (let ((comment-start ";;"))
               (comment-region (point-min) (point-max)))
             (delete-trailing-whitespace (point-min) (point-max))
             (concat (buffer-string) "\n")))))
    (if (called-interactively-p 'any)
        (insert fortune)
      fortune)))

;; initial-scratch-message
(let ((fortune (my-fortune-scratch-message)))
  (when fortune
    (setq initial-scratch-message fortune)))
#+END_SRC

*** Use modeline flash as a visible bell.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun rtg/flash-mode-line ()
  (invert-face 'mode-line)
  (run-with-timer 0.05 nil 'invert-face 'mode-line))
(setq-default
 ring-bell-function 'rtg/flash-mode-line)
#+END_SRC

*** Some mods and tweaks in the echo area:

#+BEGIN_SRC emacs-lisp :tangle yes
(setq echo-keystrokes 0.1
      use-dialog-box nil
      visible-bell nil)
#+END_SRC

*** Smart tab behavior: indent or complete?

#+BEGIN_SRC emacs-lisp :tangle yes
(setq tab-always-indent 'complete)
#+END_SRC

*** yes should always be y.

#+BEGIN_SRC emacs-lisp :tangle yes
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

*** Bounce the ~ backup files into their own directory.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
#+END_SRC

*** Windmove for org-mode is C-z left, right, up or down.

#+BEGIN_SRC emacs-lisp :tangle yes
;; Redefine the default Emacs suspend keybinding...
(global-unset-key (kbd "C-z")) ; windmove prefix
(global-set-key (kbd "C-z C-z") 'suspend-frame)
;; so that windmove plays nice with org-mode
(global-set-key (kbd "C-z <left>") 'windmove-left)
(global-set-key (kbd "C-z <down>") 'windmove-down)
(global-set-key (kbd "C-z <up>") 'windmove-up)
(global-set-key (kbd "C-z <right>") 'windmove-right)
;; where S <left/right/up/down> still works outside org
#+END_SRC

*** Add a new line at the end of a given file.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq require-final-newline t)
#+END_SRC
** 03. Theme Preferences

*** I use Emacs built-in customize for themes.

#+BEGIN_SRC emacs-lisp :tangle yes
(disable-theme 'zenburn)
#+END_SRC

*** Enable transparency for frames and windows.

#+BEGIN_SRC emacs-lisp :tangle yes
(set-frame-parameter (selected-frame) 'alpha '(92 50))
(add-to-list 'default-frame-alist '(alpha 92 50))
(eval-when-compile (require 'cl))
(defun toggle-transparency ()
  (interactive)
  (if (/=
       (cadr (frame-parameter nil 'alpha))
       100)
      (set-frame-parameter nil 'alpha '(100 100))
    (set-frame-parameter nil 'alpha '(92 50))))
(defun transparency (92)
  "Sets the transparency of the frame window. 0=transparent/100=opaque"
  (interactive "nTransparency Value 0 - 100 opaque:")
  (set-frame-parameter (selected-frame) 'alpha value))
;; Toggle the transparency with F5
(global-set-key [f5] 'toggle-transparency)
#+END_SRC
** 04. Mode Specific (General)

*** Enable ivy, swiper and counsel and set keys.

#+BEGIN_SRC emacs-lisp :tangle yes
(ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
(global-set-key "\C-s" 'swiper)
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
#+END_SRC

*** Disable guru-mode because arrow keys are sometimes useful.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq prelude-guru nil)
#+END_SRC

*** Enable winner-mode.

#+BEGIN_SRC emacs-lisp :tangle yes
(winner-mode 1)
#+END_SRC

*** Enable which-key mode.

#+BEGIN_SRC emacs-lisp :tangle yes
(which-key-mode)
#+END_SRC

*** Enable undo-tree-mode visualization with C-x u.

#+BEGIN_SRC emacs-lisp :tangle yes
(global-undo-tree-mode)
#+END_SRC

*** Enable toggle for project explorer.

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "C-c SPC") 'project-explorer-toggle)
#+END_SRC

*** Enable and set ztree keybindings.

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "C-c z") 'ztree-diff)
(global-set-key (kbd "C-c Z") 'ztree-dir)
#+END_SRC

*** Enable and set multiple cursors keybindings

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
(global-set-key (kbd "C->") 'mc/mark-next-like-this)
(global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
#+END_SRC
** 05. Dired & Ibuffer Tweaks

*** dired: Human readable sizes and sort by size.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq dired-listing-switches "-alh")
#+END_SRC

*** dired: Work better with files in different directories.

#+BEGIN_SRC emacs-lisp :tangle yes
(require 'find-dired)
(setq find-ls-option '("-print0 | xargs -0 ls -ld" . "-ld"))
#+END_SRC

