rtg-init.org
*** Ibuffer: Use Gnus-style grouping for list.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq ibuffer-saved-filter-groups
      (quote (("default"
               ("dired" (mode . dired-mode))
               ("web" (or
                       (mode . css-mode)
                       (mode . scss-mode)
                       (mode . js2-mode)
                       (mode . ruby-mode)
                       (mode . web-mode)))
               ("org" (or
                           (name . "^\\*Calendar\\*$")
                           (name . "^diary$")
                           (mode . org-mode)))
               ("gnus" (or
                        (mode . message-mode)
                        (mode . bbdb-mode)
                        (mode . mail-mode)
                        (mode . gnus-group-mode)
                        (mode . gnus-summary-mode)
                        (mode . gnus-article-mode)
                        (name . "^\\.bbdb$")
                        (name . "^\\.newsrc-dribble")))
               ("eww" (or
                       (mode . eww-mode)
                       (mode . eww-bookmark-mode)))
               ("emacs" (or
                         (name . "^\\*scratch\\*$")
                         (name . "^\\*Messages\\*$")))))))

(add-hook 'ibuffer-mode-hook
          (lambda ()
            (ibuffer-switch-to-saved-filter-groups "default")))
#+END_SRC

*** Ibuffer: Use human readable size column instead of original one.

#+BEGIN_SRC emacs-lisp :tangle yes
(define-ibuffer-column size-h
  (:name "Size" :inline t)
  (cond
   ((> (buffer-size) 1000000) (format "%7.1fM" (/ (buffer-size) 1000000.0)))
   ((> (buffer-size) 100000) (format "%7.0fk" (/ (buffer-size) 1000.0)))
   ((> (buffer-size) 1000) (format "%7.1fk" (/ (buffer-size) 1000.0)))
   (t (format "%8d" (buffer-size)))))
#+END_SRC

*** Ibuffer: Modify the default ibuffer-formats.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq ibuffer-formats
      '((mark modified read-only " "
              (name 18 18 :left :elide)
              " "
              (size-h 9 -1 :right)
              " "
              (mode 16 16 :left :elide)
              " "
              filename-and-process)))
#+END_SRC
** 06. Terminals and Shells

*** Setup bash for use with multi-term.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq multi-term-program "/bin/bash")
#+END_SRC

*** Setup multi-term for practical use.

#+BEGIN_SRC emacs-lisp :tangle yes
(when (require 'multi-term nil t)
  (global-set-key (kbd "C-x t") 'multi-term)
  (global-set-key (kbd "<C-next>") 'multi-term-next)
  (global-set-key (kbd "<C-prior>") 'multi-term-prev)
  (setq multi-term-buffer-name "mterm"
        multi-term-program "/bin/bash"))
#+END_SRC

*** Declare multi-term keybindings.

#+BEGIN_SRC emacs-lisp :tangle yes
(when (require 'term nil t) ; only if term can be loaded..
  (setq term-bind-key-alist
        (list (cons "C-c C-c" 'term-interrupt-subjob)
              (cons "C-p" 'previous-line)
              (cons "C-n" 'next-line)
              (cons "M-f" 'term-send-forward-word)
              (cons "M-b" 'term-send-backward-word)
              (cons "C-c C-j" 'term-line-mode)
              (cons "C-c C-k" 'term-char-mode)
              (cons "M-DEL" 'term-send-backward-kill-word)
              (cons "M-d" 'term-send-forward-kill-word)
              (cons "<C-left>" 'term-send-backward-word)
              (cons "<C-right>" 'term-send-forward-word)
              (cons "C-r" 'term-send-reverse-search-history)
              (cons "M-p" 'term-send-raw-meta)
              (cons "M-y" 'term-send-raw-meta)
              (cons "C-y" 'term-send-raw))))
#+END_SRC
** 07. Org-mode Configuration

*** Main files are found here. Add new project files to the list as needed.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-agenda-files
      (list "~/org/gtd.org"
            "~/org/work.org"
            "~/org/personal.org"))
#+END_SRC

*** Set the interactive gtd file.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun gtd ()
  (interactive)
  (find-file "~/org/gtd.org")
  )
#+END_SRC

*** Org-capture to my personal.org file.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-default-notes-file "~/org/personal.org")
;; Org-capture keybinding
(global-set-key (kbd "C-c c") 'org-capture)
#+END_SRC

*** Function to capture a todo.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun rtg/org-capture-todo ()
  (interactive)
  "Capture a TODO item"
  (org-capture nil "t"))
;; bind
(define-key global-map (kbd "C-7") 'rtg/org-capture-todo)
#+END_SRC

*** Set return to activate a link.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-return-follows-link t)
#+END_SRC

*** Setup org mode agenda.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'load-path "~/emacs/org")
(require 'org)
(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(setq org-log-done t)
#+END_SRC

*** Custom org-agenda commands.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-agenda-custom-commands
      '(("w" todo "WAITING" nil)
        ("n" todo "NEXT" nil)
        ("d" "Agenda + Next Actions" ((agenda) (todo "NEXT"))))
      )
#+END_SRC

*** Refile: show all headings from all agenda files.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-refile-targets '((org-agenda-files . (:maxlevel . 5))))
#+END_SRC

*** AGENDA: From http://pages.sachachua.com/.emacs.d/Sacha.html#org6eefca2


**** Mark TODO as done by simply hitting 'x'.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun rtg/org-agenda-done (&optional arg)
  "Mark current TODO as done.
This changes the line at point, all other lines in the agenda referring to
the same tree node, and the headline of the tree node in the Org-mode file."
  (interactive "P")
  (org-agenda-todo "DONE"))
;; Override the key definition for org-exit
(define-key org-agenda-mode-map "x" 'rtg/org-agenda-done)
#+END_SRC

**** Mark TODO as done with 'X' and then create new task at same level.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun rtg/org-agenda-mark-done-and-add-followup ()
  "Mark the current TODO as done and add another task after it.
Creates it at the same level as the previous task, so it's better to use
this with to-do items than with projects or headings."
  (interactive)
  (org-agenda-todo "DONE")
  (org-agenda-switch-to)
  (org-capture 0 "t"))
;; Override the key definition
(define-key org-agenda-mode-map "X" 'rtg/org-agenda-mark-done-and-add-followup)
#+END_SRC

**** Capture something based on the agenda.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun rtg/org-agenda-new ()
  "Create a new note or task at the current agenda item.
Creates it at the same level as the previous task, so it's better to use
this with to-do items than with projects or headings."
  (interactive)
  (org-agenda-switch-to)
  (org-capture 0))
;; New key assignment
(define-key org-agenda-mode-map "N" 'rtg/org-agenda-new)
#+END_SRC

**** Keep track of unscheduled tasks and stuck projects.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun rtg/org-agenda-list-unscheduled (&rest ignore)
  "Create agenda view for tasks that are unscheduled and not done."
  (let* ((org-agenda-todo-ignore-with-date t)
         (org-agenda-overriding-header "List of unscheduled tasks: "))
    (org-agenda-get-todos)))
(setq org-stuck-projects
      '("+PROJECT-MAYBE-DONE"
        ("TODO")
        nil
        "\\<IGNORE\\>"))
#+END_SRC

*** Extra org modules and export backends.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-modules '(org-bbdb
                    org-gnus))
(eval-after-load 'org
  '(org-load-modules-maybe t))
#+END_SRC

*** Prepare stuff for org-export-backends.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-export-backends '(org latex html ascii))
#+END_SRC

** 08. Web Development

*** General:

**** Align code in a pretty way.

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "C-x \\") #'align-regexp)
#+END_SRC

**** Syntax highlighting of dash functions

#+BEGIN_SRC emacs-lisp :tangle yes
(eval-after-load 'dash '(dash-enable-font-lock))
#+END_SRC

*** yasnippet

**** Load yasnippet.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'load-path
             "~/.emacs.d/plugins/yasnippet")
(require 'yasnippet)
(yas-global-mode 1)
#+END_SRC

**** yasnippet expansion and completion with dropdown.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq yas-prompt-functions '(yas-x-prompt yas-dropdown-prompt))
#+END_SRC
*** web-mode

**** Enforce two space indentation rule for web mode.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun my-web-mode-hook ()
  "Hooks for Web mode."
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq web-mode-code-indent-offset 2)
)
(add-hook 'web-mode-hook  'my-web-mode-hook)
#+END_SRC

**** Enable web mode and css mode hooks for Emmet.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'web-mode-hook 'emmet-mode)
(add-hook 'css-mode-hook  'emmet-mode)
#+END_SRC

**** Get company-mode to work well with web-mode.

#+BEGIN_SRC emacs-lisp :tangle yes
(eval-after-load 'company-etags
  '(progn
     (add-to-list 'company-etags-modes 'web-mode)))
#+END_SRC
**** WordPress coding style

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'php-mode-hook 'php-enable-wordpress-coding-style)
#+END_SRC
*** JavaScript

**** js2 mode hook for js2-refactor mode.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'js2-mode-hook #'js2-refactor-mode)
#+END_SRC

