rtg-init.org
**** Prevent parse errors from using js2-refactor

#+BEGIN_SRC emacs-lisp :tangle yes
(setq js2-skip-preprocessor-directives t)
#+END_SRC

**** Set default mode for JSON files.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'auto-mode-alist '("\\.json$" . json-mode))
#+END_SRC

**** Impatient mode: Real-time changes typing HTML.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'load-path "~/.emacs.d/impatient-mode")
(require 'impatient-mode)
#+END_SRC

**** Skewer mode: Live JS development in the browser.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'js2-mode-hook 'skewer-mode)
(add-hook 'web-mode-hook 'skewer-css-mode)
(add-hook 'web-mode-hook 'skewer-html-mode)
#+END_SRC

** 09. Miscellaneous Stuff

*** Insert the date and time anywhere.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun put-date ()
  (interactive)
  (insert (shell-command-to-string "date")))
#+END_SRC

*** Delighted: no clutter - C-h m instead

#+BEGIN_SRC emacs-lisp :tangle yes
(delight '((auto-complete-mode nil "auto-complete")
           (beacon-mode nil "beacon")
           (company-mode nil "company")
           (emmet-mode nil "emmet-mode")
           (flycheck-mode nil "flycheck")
           (flyspell-mode nil "flyspell")
           (prelude-mode nil "prelude-mode")
           (projectile-mode nil "projectile")
           (smartparens-mode nil "smartparens")
           (skewer-mode nil "skewer-mode")
           (skewer-css-mode nil "skewer-css")
           (skewer-html-mode nil "skewer-html")
           (which-key-mode nil "which-key")
           (whitespace-mode nil "whitespace")
           (yas-minor-mode nil "yasnippet")
           (emacs-lisp-mode "EL" :major)))
#+END_SRC

*** Hippie expand.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq hippie-expand-try-functions-list '(try-expand-dabbrev
                                         try-expand-dabbrev-all-buffers
                                         try-expand-dabbrev-from-kill
                                         try-complete-file-name-partially
                                         try-complete-file-name
                                         try-expand-all-abbrevs
                                         try-expand-list
                                         try-expand-line
                                         try-complete-lisp-symbol-partially
                                         try-complete-lisp-symbol))
#+END_SRC

*** Use hippie-expand instead of dabbrev.

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "M-/") #'hippie-expand)
(global-set-key (kbd "s-/") #'hippie-expand)
#+END_SRC

*** Browsing choices: EWW or Firefox.

#+BEGIN_SRC emacs-lisp :tangle yes
(defalias 'gk-urls-external-browser 'browse-url-xdg-open)
(defun gk-browse-url (&rest args)
  "Prompt for whether or not to browse with EWW, if no browse
with external browser."
  (apply
   (if (y-or-n-p "Browse with EWW? ")
       'eww-browse-url
     'gk-urls-external-browser)
   args))
(setq browse-url-browser-function #'gk-browse-url)
#+END_SRC

*** Generation of multiple eww buffers.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun eww-new ()
  (interactive)
  (let ((url (read-from-minibuffer "Enter URL or keywords: ")))
    (switch-to-buffer (generate-new-buffer "eww"))
    (eww-mode)
    (eww url)))
#+END_SRC

** 10. Close Init

#+BEGIN_SRC emacs-lisp :tangle yes
;; End init file...
(provide 'rtg-init)
;;; rtg-init.el ends here
#+END_SRC
